In [1]:

import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt
import numpy as np
import matplotlib
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
from sklearn.metrics import confusion_matrix, accuracy_score
from mlxtend.plotting import plot_confusion_matrix

In [2]:
import tensorflow as tf
from tensorflow import keras
from tensorflow.keras import Sequential
from tensorflow.keras.layers import Flatten, Dense

In [3]:
# Read the dataset
bank_df = pd.read_csv('Churn_Modelling.csv')

In [4]:
bank_df.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [5]:
X = bank_df.drop(labels=['CustomerId', 'Surname', 'RowNumber', 'Exited'], axis = 1)
y = bank_df['Exited']

In [6]:
X.head()

   CreditScore Geography  Gender  ...  HasCrCard  IsActiveMember  EstimatedSalary
0          619    France  Female  ...          1               1        101348.88
1          608     Spain  Female  ...          0               1        112542.58
2          502    France  Female  ...          1               0        113931.57
3          699    France  Female  ...          0               0         93826.63
4          850     Spain  Female  ...          1               1         79084.10

[5 rows x 10 columns]

In [7]:
X.isnull().sum()

CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
dtype: int64

In [8]:
label1 = LabelEncoder()
X['Geography'] = label1.fit_transform(X['Geography'])

In [9]:
label = LabelEncoder()
X['Gender'] = label.fit_transform(X['Gender'])
X.head()

   CreditScore  Geography  Gender  ...  HasCrCard  IsActiveMember  EstimatedSalary
0          619          0       0  ...          1               1        101348.88
1          608          2       0  ...          0               1        112542.58
2          502          0       0  ...          1               0        113931.57
3          699          0       0  ...          0               0         93826.63
4          850          2       0  ...          1               1         79084.10

[5 rows x 10 columns]

In [10]:
X = pd.get_dummies(X, drop_first=True, columns=['Geography'])
X.head()

   CreditScore  Gender  Age  ...  EstimatedSalary  Geography_1  Geography_2
0          619       0   42  ...        101348.88            0            0
1          608       0   41  ...        112542.58            0            1
2          502       0   42  ...        113931.57            0            0
3          699       0   39  ...         93826.63            0            0
4          850       0   43  ...         79084.10            0            1

[5 rows x 11 columns]

In [11]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 0, stratify = y)

In [12]:
scaler = StandardScaler()
X_train = scaler.fit_transform(X_train)
X_test = scaler.transform(X_test)

In [13]:
X.shape

(10000, 11)

In [14]:
model = Sequential()
model.add(Dense(X.shape[1], activation='relu', input_dim = X.shape[1]))
model.add(Dense(128, activation='relu'))
model.add(Dense(1, activation = 'sigmoid'))

In [15]:
model.compile(optimizer='adam', loss = 'binary_crossentropy', metrics=['accuracy'])

In [16]:
model.fit(X_train, y_train.to_numpy(), batch_size = 10, epochs = 10, verbose = 1)

Epoch 1/10
800/800 [==============================] - 1s 1ms/step - loss: 0.4541 - accuracy: 0.7971
Epoch 2/10
800/800 [==============================] - 1s 1ms/step - loss: 0.3882 - accuracy: 0.8338
Epoch 3/10
800/800 [==============================] - 1s 1ms/step - loss: 0.3639 - accuracy: 0.8479
Epoch 4/10
800/800 [==============================] - 1s 1ms/step - loss: 0.3553 - accuracy: 0.8516
Epoch 5/10
800/800 [==============================] - 1s 1ms/step - loss: 0.3494 - accuracy: 0.8556
Epoch 6/10
800/800 [==============================] - 1s 1ms/step - loss: 0.3449 - accuracy: 0.8546
Epoch 7/10
800/800 [==============================] - 1s 1ms/step - loss: 0.3402 - accuracy: 0.8609
Epoch 8/10
800/800 [==============================] - 1s 1ms/step - loss: 0.3394 - accuracy: 0.8600
Epoch 9/10
800/800 [==============================] - 1s 1ms/step - loss: 0.3356 - accuracy: 0.8629
Epoch 10/10
800/800 [==============================] - 1s 1ms/step - loss: 0.3333 - accuracy: 0.8618

In [17]:
y_pred = model.predict_classes(X_test)

WARNING:tensorflow:From <ipython-input-17-fdaaf2360398>:1: Sequential.predict_classes (from tensorflow.python.keras.engine.sequential) is deprecated and will be removed after 2021-01-01.
Instructions for updating:
Please use instead:* `np.argmax(model.predict(x), axis=-1)`,   if your model does multi-class classification   (e.g. if it uses a `softmax` last-layer activation).* `(model.predict(x) > 0.5).astype("int32")`,   if your model does binary classification   (e.g. if it uses a `sigmoid` last-layer activation).

In [18]:
y_test

1344    1
8167    0
4747    0
5004    1
3124    1
       ..
9107    0
8249    0
8337    0
6279    1
412     0
Name: Exited, Length: 2000, dtype: int64

In [19]:
model.evaluate(X_test, y_test.to_numpy())

63/63 [==============================] - 0s 790us/step - loss: 0.3622 - accuracy: 0.8550

[0.3621867001056671, 0.8550000190734863]

In [20]:
confusion_matrix(y_test, y_pred)

array([[1550,   43],
       [ 247,  160]])

In [21]:
accuracy_score(y_test, y_pred)

0.855